# ImportIFC Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IIFCImporterServer..::..ImportIFC Method
IIFCImporterServer Interface See Also
---
The method that Revit will invoke to perform an import from IFC.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void ImportIFC(
	ImporterIFC importer
)
```

Visual Basic
---
```text
Sub ImportIFC ( _
	importer As ImporterIFC _
)
```

Visual C++
---
```text
void ImportIFC(
	ImporterIFC^ importer
)
```

# ### Parameters
importer
    Type: Autodesk.Revit.DB.IFC..::..ImporterIFC The IFC importer.
# See Also
IIFCImporterServer Interface
Autodesk.Revit.DB.IFC Namespace